# TODO:单样本T检验
from scipy.stats import ttest_1samp

# 示例数据
data = [58.5298199, 52.35303878, 74.4461695, 52.98326296, 55.87687873, 67.65984894,
        47.72614076, 50.26690674, 56.50082581, 52.36104034, 45.4578831, 53.36098792,
        52.12936842, 59.82777282, 41.68169176, 49.3985677, 64.21112808, 69.85864806,
        42.91056354, 60.15878009]

# 假设的总体均值
# H0（零假设）：两个配对样本的均值差异为零（无显著差异）
# H1（备择假设）：两个配对样本的均值差异不为零（有显著差异）
population_mean = 50
# 进行单样本T检验
t_statistic, p_value = ttest_1samp(data, population_mean)
t_result = f"T-statistic: {round(t_statistic,3)}, P-value: {round(p_value,3)}"
# 结果
if round(p_value, 3) < 0.05:
    print(f"{t_result},p值<0.05，因此拒绝原假设，即认为样本均值显著不同于50。")
else:
    print(f"{t_result},p值>0.05，因此拒绝备译假设，即认为样本均值显著相同于50。")
