# TODO:配对样本T检验
from scipy.stats import ttest_rel
import numpy as np

# 配对样本数据
before = [120, 115, 130, 125, 135]  # 干预前的数据
after = [110, 112, 128, 126, 132]   # 干预后的数据
# H0（零假设）：两个配对样本的均值差异为零（无显著差异）
# 𝐻1（备择假设）：两个配对样本的均值差异不为零（有显著差异）
# 进行配对样本T检验
t_statistic, p_value = ttest_rel(before, after)
t_result = f"T-statistic: {round(t_statistic,3)}, P-value: {round(p_value,3)}"
# 结果
if round(p_value, 3) < 0.05:
    print(f"{t_result},p值<0.05，因此拒绝零假设，意味着干预前后数据的均值差异显著，即干预产生了统计学意义上的效果。")
else:
    print(f"{t_result},p值>0.05，因此无法拒绝零假设，意味着干预前后数据的均值差异不显著，即干预可能没有产生统计学意义上的效果。")
